In [2]:
import pandas as pd

df = pd.DataFrame({
    "EmpID": [101,102,103,104,105,106],
    "Name": ["Aman","Riya","Kunal","Sneha","Vikram","Pooja"],
    "JoinDate": [
        "12-01-2021",
        "25-03-2020",
        "10-07-2022",
        "05-11-2019",
        "18-06-2021",
        "01-02-2023"
    ],
    "Salary": [50000,48000,62000,70000,45000,58000]
})

PART 1: Date Conversion (Basics)

In [ ]:
df["JoinDate"] = pd.to_datetime( df["JoinDate"], format="%d-%m-%Y", errors="coerce")

In [4]:
# Check the datatype of all columns
df.dtypes

EmpID                int64
Name                object
JoinDate    datetime64[ns]
Salary               int64
dtype: object

In [5]:
# What is the datatype of JoinDate after conversion?
#Answer: dtype('<M8[ns]') this corresponds to the datetime64[ns] data type

PART 2: Extract Date Components

In [6]:
# Create a new column Year from JoinDate
df["Year"] = df["JoinDate"].dt.year

In [7]:
df

   EmpID    Name   JoinDate  Salary  Year
0    101    Aman 2021-01-12   50000  2021
1    102    Riya 2020-03-25   48000  2020
2    103   Kunal 2022-07-10   62000  2022
3    104   Sneha 2019-11-05   70000  2019
4    105  Vikram 2021-06-18   45000  2021
5    106   Pooja 2023-02-01   58000  2023

In [8]:
# Create a column Month_Name (January, February…)
df["Month_Name"] = df["JoinDate"].dt.month_name()
df

   EmpID    Name   JoinDate  Salary  Year Month_Name
0    101    Aman 2021-01-12   50000  2021    January
1    102    Riya 2020-03-25   48000  2020      March
2    103   Kunal 2022-07-10   62000  2022       July
3    104   Sneha 2019-11-05   70000  2019   November
4    105  Vikram 2021-06-18   45000  2021       June
5    106   Pooja 2023-02-01   58000  2023   February

In [9]:
# Create a column Day_Name (Monday, Tuesday…)
df["Day_Name"] = df["JoinDate"].dt.day_name()
df

   EmpID    Name   JoinDate  Salary  Year Month_Name   Day_Name
0    101    Aman 2021-01-12   50000  2021    January    Tuesday
1    102    Riya 2020-03-25   48000  2020      March  Wednesday
2    103   Kunal 2022-07-10   62000  2022       July     Sunday
3    104   Sneha 2019-11-05   70000  2019   November    Tuesday
4    105  Vikram 2021-06-18   45000  2021       June     Friday
5    106   Pooja 2023-02-01   58000  2023   February  Wednesday

PART 3: Date Filtering (VERY IMPORTANT)

In [10]:
# Show employees who joined after 2021-01-01

df[df["JoinDate"]> "2021-01-01"]

   EmpID    Name   JoinDate  Salary  Year Month_Name   Day_Name
0    101    Aman 2021-01-12   50000  2021    January    Tuesday
2    103   Kunal 2022-07-10   62000  2022       July     Sunday
4    105  Vikram 2021-06-18   45000  2021       June     Friday
5    106   Pooja 2023-02-01   58000  2023   February  Wednesday

In [11]:
# Show employees who joined between 2020 and 2021

df[(df["JoinDate"].dt.year >= 2020) & (df["JoinDate"].dt.year <= 2021)]

   EmpID    Name   JoinDate  Salary  Year Month_Name   Day_Name
0    101    Aman 2021-01-12   50000  2021    January    Tuesday
1    102    Riya 2020-03-25   48000  2020      March  Wednesday
4    105  Vikram 2021-06-18   45000  2021       June     Friday

In [12]:
# Show employees who joined in year 2021 only
df[df["JoinDate"].dt.year == 2021]

   EmpID    Name   JoinDate  Salary  Year Month_Name Day_Name
0    101    Aman 2021-01-12   50000  2021    January  Tuesday
4    105  Vikram 2021-06-18   45000  2021       June   Friday

PART 4: Date Arithmetic (Timedelta)

In [13]:
# Add 90 days to each JoinDate and store in new column Probation_End
df["Probation_End"] = pd.Timedelta(days=90) + df["JoinDate"]

In [14]:
df

   EmpID    Name   JoinDate  Salary  Year Month_Name   Day_Name Probation_End
0    101    Aman 2021-01-12   50000  2021    January    Tuesday    2021-04-12
1    102    Riya 2020-03-25   48000  2020      March  Wednesday    2020-06-23
2    103   Kunal 2022-07-10   62000  2022       July     Sunday    2022-10-08
3    104   Sneha 2019-11-05   70000  2019   November    Tuesday    2020-02-03
4    105  Vikram 2021-06-18   45000  2021       June     Friday    2021-09-16
5    106   Pooja 2023-02-01   58000  2023   February  Wednesday    2023-05-02

In [15]:
# Find number of days each employee has worked till today
# (Hint: pd.Timestamp.today())
today = pd.Timestamp.today()
df["Working_Days"] = (today - df["JoinDate"]).dt.days
df

,EmpID,Name,JoinDate,Salary,Year,Month_Name,Day_Name,Probation_End,Working_Days
0,101,Aman,2021-01-12,50000,2021,January,Tuesday,2021-04-12,1847
1,102,Riya,2020-03-25,48000,2020,March,Wednesday,2020-06-23,2140
2,103,Kunal,2022-07-10,62000,2022,July,Sunday,2022-10-08,1303
3,104,Sneha,2019-11-05,70000,2019,November,Tuesday,2020-02-03,2281
4,105,Vikram,2021-06-18,45000,2021,June,Friday,2021-09-16,1690
5,106,Pooja,2023-02-01,58000,2023,February,Wednesday,2023-05-02,1097

PART 5: Sorting & Index

In [16]:
# Sort DataFrame by JoinDate (oldest → newest)
df.sort_values(by="JoinDate",inplace=True)
df.reset_index(drop=True,inplace=True)
df

,EmpID,Name,JoinDate,Salary,Year,Month_Name,Day_Name,Probation_End,Working_Days
0,104,Sneha,2019-11-05,70000,2019,November,Tuesday,2020-02-03,2281
1,102,Riya,2020-03-25,48000,2020,March,Wednesday,2020-06-23,2140
2,101,Aman,2021-01-12,50000,2021,January,Tuesday,2021-04-12,1847
3,105,Vikram,2021-06-18,45000,2021,June,Friday,2021-09-16,1690
4,103,Kunal,2022-07-10,62000,2022,July,Sunday,2022-10-08,1303
5,106,Pooja,2023-02-01,58000,2023,February,Wednesday,2023-05-02,1097

In [17]:
# Sort DataFrame by JoinDate (newest → oldest)
df.sort_values(by="JoinDate",ascending=False,inplace=True)
df

,EmpID,Name,JoinDate,Salary,Year,Month_Name,Day_Name,Probation_End,Working_Days
5,106,Pooja,2023-02-01,58000,2023,February,Wednesday,2023-05-02,1097
4,103,Kunal,2022-07-10,62000,2022,July,Sunday,2022-10-08,1303
3,105,Vikram,2021-06-18,45000,2021,June,Friday,2021-09-16,1690
2,101,Aman,2021-01-12,50000,2021,January,Tuesday,2021-04-12,1847
1,102,Riya,2020-03-25,48000,2020,March,Wednesday,2020-06-23,2140
0,104,Sneha,2019-11-05,70000,2019,November,Tuesday,2020-02-03,2281

In [18]:
# # Set JoinDate as index
df.set_index("JoinDate",inplace=True)

In [19]:
df

,EmpID,Name,Salary,Year,Month_Name,Day_Name,Probation_End,Working_Days
JoinDate,,,,,,,,
2023-02-01,106,Pooja,58000,2023,February,Wednesday,2023-05-02,1097
2022-07-10,103,Kunal,62000,2022,July,Sunday,2022-10-08,1303
2021-06-18,105,Vikram,45000,2021,June,Friday,2021-09-16,1690
2021-01-12,101,Aman,50000,2021,January,Tuesday,2021-04-12,1847
2020-03-25,102,Riya,48000,2020,March,Wednesday,2020-06-23,2140
2019-11-05,104,Sneha,70000,2019,November,Tuesday,2020-02-03,2281

In [20]:
# After setting index, show all employees who joined in 2021
df[df.index.year == 2021]

,EmpID,Name,Salary,Year,Month_Name,Day_Name,Probation_End,Working_Days
JoinDate,,,,,,,,
2021-06-18,105,Vikram,45000,2021,June,Friday,2021-09-16,1690
2021-01-12,101,Aman,50000,2021,January,Tuesday,2021-04-12,1847

PART 6: Real-Life Tasks

In [21]:
# Create a column Service_Years
# (Service years = difference between today and JoinDate in years)

today = pd.Timestamp.today()
df["Service_Years"] = (today.year-df.index.year)
df

,EmpID,Name,Salary,Year,Month_Name,Day_Name,Probation_End,Working_Days,Service_Years
JoinDate,,,,,,,,,
2023-02-01,106,Pooja,58000,2023,February,Wednesday,2023-05-02,1097,3
2022-07-10,103,Kunal,62000,2022,July,Sunday,2022-10-08,1303,4
2021-06-18,105,Vikram,45000,2021,June,Friday,2021-09-16,1690,5
2021-01-12,101,Aman,50000,2021,January,Tuesday,2021-04-12,1847,5
2020-03-25,102,Riya,48000,2020,March,Wednesday,2020-06-23,2140,6
2019-11-05,104,Sneha,70000,2019,November,Tuesday,2020-02-03,2281,7

In [22]:
# Create a column Experience_Level

# Service ≥ 3 years → "Senior"

# Service < 3 years → "Junior"
df["Experience_Level"] = 'Junior'
df.loc[df["Service_Years"]>4,"Experience_Level"] = "Senior"

In [23]:
df

,EmpID,Name,Salary,Year,Month_Name,Day_Name,Probation_End,Working_Days,Service_Years,Experience_Level
JoinDate,,,,,,,,,,
2023-02-01,106,Pooja,58000,2023,February,Wednesday,2023-05-02,1097,3,Junior
2022-07-10,103,Kunal,62000,2022,July,Sunday,2022-10-08,1303,4,Junior
2021-06-18,105,Vikram,45000,2021,June,Friday,2021-09-16,1690,5,Senior
2021-01-12,101,Aman,50000,2021,January,Tuesday,2021-04-12,1847,5,Senior
2020-03-25,102,Riya,48000,2020,March,Wednesday,2020-06-23,2140,6,Senior
2019-11-05,104,Sneha,70000,2019,November,Tuesday,2020-02-03,2281,7,Senior

In [24]:
# Find average salary of employees who joined after 2020
Emp_after_2020 = df.loc[df.index.year >2020,"Salary"]

In [25]:
print("The average salary of employees who joined after 2020 is: ",Emp_after_2020.mean())

The average salary of employees who joined after 2020 is:  53750.0

In [26]:
avg_salary = df.loc[df.index.year > 2020, "Salary"].mean()
avg_salary

np.float64(53750.0)

In [27]:
# Replace any invalid JoinDate with NaT safely
df.replace("")

/var/folders/r7/f95gykkj207bjlzqqdrkl7d40000gn/T/ipykernel_14874/1463945287.py:2: FutureWarning: DataFrame.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  df.replace("")

,EmpID,Name,Salary,Year,Month_Name,Day_Name,Probation_End,Working_Days,Service_Years,Experience_Level
JoinDate,,,,,,,,,,
2023-02-01,106,Pooja,58000,2023,February,Wednesday,2023-05-02,1097,3,Junior
2022-07-10,103,Kunal,62000,2022,July,Sunday,2022-10-08,1303,4,Junior
2021-06-18,105,Vikram,45000,2021,June,Friday,2021-09-16,1690,5,Senior
2021-01-12,101,Aman,50000,2021,January,Tuesday,2021-04-12,1847,5,Senior
2020-03-25,102,Riya,48000,2020,March,Wednesday,2020-06-23,2140,6,Senior
2019-11-05,104,Sneha,70000,2019,November,Tuesday,2020-02-03,2281,7,Senior